from utils import encrypt_polybius_square, decrypt_polybius_square
dict_alphabets = {
    'а':'11', 'б':'12', 'в':'13', 'г':'14', 'ґ':'15', 'д':'16',
    'е':'21', 'є':'22', 'ж':'23', 'з':'24', 'и':'24', 'і':'25',
    'ї':'31', 'й':'32', 'к':'33', 'л':'34', 'м':'35', 'н':'36',
    'о':'41', 'п':'42', 'р':'43', 'с':'44', 'т':'45', 'у':'46',
    'ф':'51', 'х':'52', 'ц':'53', 'ч':'54', 'ш':'55', 'щ':'56',
    'ь':'61', 'ю':'62', 'я':'63', ' ':'64'
}
text = input("Ведіть текст для шифрування:\n").lower()

print('--------------------------------------------------------')
print('Шифрування...')
try:
    encrypted_text =encrypt_polybius_square(text, dict_alphabets)
    print('Зашифрований текст:', encrypted_text)

    print('--------------------------------------------------------')
    print('Розшифрування...')
    text = decrypt_polybius_square(encrypted_text, dict_alphabets)
    print('Розшифрований текст:', text)
except KeyError:
    print('Ви ввели текст, який містить символи відмінні від українського\n'
          'алфавіту, спробуйте ще раз!')


